src/cf/Catalogs/вогКоллекцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогКоллекцииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогУровниГруппировкиКоллекцийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогКоллекцииНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НаправленияДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>НаправленияДеятельности</Name>
			<Comment>Не переносить в объединенные решения</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособУправленияНоменклатурой</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогСпособыУправленияНоменклатурой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогЦвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогГруппыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаФормированияУровнейГруппировок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УровеньГруппировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогУровниГруппировкиКоллекцийНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/вогКоллекцииНоменклатуры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанныхОбъектов

Процедура ЗаполнитьУровеньГруппировкиКоллекции(ОбъектКоллекция) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Направление", ОбъектКоллекция.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Уровень"	   , ОбъектКоллекция.Уровень());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаФормированияУровнейГруппировок.УровеньГруппировки КАК УровеньГруппировки
		|ИЗ
		|	Справочник.НаправленияДеятельности.ПравилаФормированияУровнейГруппировок КАК ПравилаФормированияУровнейГруппировок
		|ГДЕ
		|	ПравилаФормированияУровнейГруппировок.Ссылка = &Направление
		|	И ПравилаФормированияУровнейГруппировок.НомерСтроки - 1 = &Уровень";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ОбъектКоллекция.Уровень = Выборка.УровеньГруппировки;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
